Revit 2027 API
BuiltInFailures.SiteFailures.SurfaceSplit Property
 The splitting boundary must split the Surface into exactly two pieces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SurfaceSplit { get; }
Public Shared ReadOnly Property SurfaceSplit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SurfaceSplit {
	FailureDefinitionId^ get ();
}
static member SurfaceSplit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace